#include <iostream>
#include "graph.cpp"
#include "llist.cpp"
#include "tree.cpp"

/*
1. Списък (int)
  a) Сумата на всеки 2ри елемент
  б) Сумата на елементи с индекси:
    - 1
    - 1 + (числото на позиция 1)
    - (числото на позиция 1) + (числото на (числото на позиция 1))
    - ...
    докато не излезем извън списъка или не направим len/2 сумирания

    вход: 1 2 3 -1 5 2 7 8 9 10 11
    2 + (-1) + 3 + 2 + 8

    вход: 1 2 3 -1 5 2 7 8 9
    2 + (-1) + 3 + 2 // заради len/2

2. Дърво (int)
  а) Сумата на всеки връх на поддърво с нечатна височина.
       7
      /
     5
    / \
   6   4
  / \
 3   1

3 + 1 + 5 + 4
  б) Въвежда се и 2ро дърво със същата структура, но с операции:
       *
      /
     -
    / \
   +   -
  / \
 /   *
  Да се намери сумата на:
  всеки връх на поддърво с нечатна височина
  с приложена съответната операция от второто дърво
  и втори операнд - отдалечеността от върха на дървото
(3 / 3) + (1 * 3) + (5 - 1) + (4 - 2)

3. Граф (Person)
  Дали мога да се запозная с Човек X, през приятели на същата възраст.
  Аз и Човек X сме на една и съща възраст.

*/

int problem_2a(tree<int> & t, int & h) {
  if (t.empty()) {
    h = 0;
    return 0;
  }

  int hLeft = 0, hRight = 0;
  int sumLeft = problem_2a(t, hLeft);
  int sumRight = problem_2a(t, hRight);

  h = 1 + max(hLeft, hRight);
  if (h % 2 == 1) {
    return t.GetRoot() + sumLeft + sumRight;
  } else {
    return sumLeft + sumRight;
  }
}

int main() {
  return 0;
}
